{"data":{"config":{"html":"<p>El blog personal de Enrique Arias.\n<br />\n<span style=\"font-size: 0.9em; color: gray;\">Desarrollador y escritor ocasional entre otras cosas.</span></p>","fields":{"slug":"/es/"},"frontmatter":{"title":"Apuntes nocturnos","language":"es"}},"markdownRemark":{"id":"40b37c80-423d-56cb-b379-7ae1e4940277","excerpt":"En un  artículo anterior  tratábamos el tema de las funciones puras. El texto introduce de manera implícita el concepto de responsabilidad…","html":"<p>En un <a href=\"/blog/pure-function\">artículo anterior</a> tratábamos el tema de las funciones puras. El texto introduce de manera implícita el concepto de responsabilidad única sin apenas profundizar en él. Entender la importancia de esta patrón de diseño me ha parecido lo suficientemente interesante como para dedicarle un <em>spin-off</em>.</p>\n<p>Si consideramos las funciones puras como los bloques fundamentales sobre los que construir un programa, es de esperar que éstos sean lo más robustos posible. La fiabilidad de estos elementos no solo serán testadas minuciosamente sino que también se construirán siguiendo una serie de patrones.</p>\n<p>Entre estos patrones se encuentra el <a href=\"https://www.wikiwand.com/es/Principio_de_responsabilidad_%C3%BAnica\">principio de responsabilidad única</a> o <em>SRP</em> (<em>single responsible principle</em>) en sus siglas inglesas. Según esta norma no se permite que una función tenga mayor propósito que el indicado. Es decir, si su cometido es capitalizar todas las letras de un texto, solo ejecuta esa tarea exclusivamente, cualquier otra acción debe que se derive de este proceso debe ser extraído a otra función. Mediante este diseño se pretende evitar los posibles comportamientos inesperados de una función multipropósito.</p>\n<p>{% highlight javascript %}\nconst showBookPreview = book => {\nconst title = <code class=\"language-text\">${book.title.charAt(0).toUpperCase()}${book.title.slice(1)}</code>;\nconst firstName = <code class=\"language-text\">${book.author.name.first.charAt(0).toUpperCase()}${book.author.name.first.slice(1)}</code>;\nconst middleName = book.author.name.middle\n? <code class=\"language-text\">${book.author.name.middle.charAt(0).toUpperCase()}${book.author.name.middle.slice(1)}</code>\n: ”;\nconst lastName = <code class=\"language-text\">${book.author.name.last.charAt(0).toUpperCase()}${book.author.name.last.slice(1)}</code>;\nconst firstChapter = book.chapters[0];\nlet excerpt = firstChapter.slice(0, 1000);</p>\n<p>  return <code class=\"language-text\">\\\n    &lt;article&gt;\\\n      &lt;header&gt;\\\n        &lt;h2&gt;${title}&lt;h2/&gt;\\\n        &lt;p&gt;${firstName} ${middleName} ${lastName}&lt;/p&gt;\\\n      &lt;/header&gt;\\\n      &lt;p&gt;${firstChapter.length &gt; 1000 ? excerpt.concat(&#39;...&#39;) : excerpt}&lt;/p&gt;\\\n    &lt;/article&gt;</code>\n};\n{% endhighlight %}</p>\n<p>Es evidente al ver el ejemplo anterior que la función cumple pocas convenciones además de contener varias operaciones claramente diferenciadas. Por lo tanto showBookPreview está imcumpliendo el patrón de responsabilidad única.</p>\n<p>Aunque yo haya escrito el ejemplo, hace tantas cosas el cuerpo de esta función que me cuesta seguirla y eso que no es más que manipular un texto y generar un nuevo resultado. Nada del otro mundo. El código podría complicar aún más si se ampliase su funcionalidad mediante accesos a BBDD, llamadas a API, resultados asíncronos, etcétera. Si a esto le sumamos la falta de familiaridad pasado un tiempo sin trabajar sobre el fuente, me encontraré a mí mismo intentando descifrar que hace exáctamente la susodicha con la consecuente pérdida de tiempo. Ni cabe que decir que cualquier otro que la encuentre por primera vez invertirá más tiempo que el propio autor. A la larga este tipo de funciones hormonadas terminan teniendo un impacto negativo en la productividad del equipo. Incluso aunque esté formado por un solo desarrollador. Hay un término que aunque su contexto sea más amplio sirve a la perfección para denominar este tipo de fuente: <a href=\"https://es.wikipedia.org/wiki/C%C3%B3digo_espagueti\">código espagueti</a>.</p>\n<p>Una pregunta que puede surgir en referencia a esta función es ¿Qué pasa si necesitamos presentar la vista preliminar en otro formato? Por lo visto tendremos que crear otra función que haga lo mismo aunque variando el formato devuelto. Obviamente no es la solución idónea. Estaríamos duplicando el mismo proceso en distintas partes del programa. Esto conlleva un mayor mantenimiento además de imcumplir otro principio tan importante como DRY (<em>Don’t Repeat Yourself</em>) o simplemente <a href=\"https://es.wikipedia.org/wiki/No_te_repitas\">no te repitas</a>.</p>\n<p>Debido a un diseño pobre esta función está mal construida desde su base. Para solucionarlo vamos a utilizar el patrón que estamos tratando en el artículo. Lo primero que debemos hacer es localizar las distintas operaciones que se efectúan en la función. Una vez localizadas las extraeremos en sus respectivas funciones.</p>\n<p>Lo primero que nos interesa es poder presentar la vista previa del libro en diferentes formatos. Esta acción transformadora se lleva a cabo en la parte inferior del cuerpo, justo donde empieza la cláusula return. Una aproximación de esta <a href=\"https://www.wikiwand.com/es/Separaci%C3%B3n_de_intereses\">separación de conceptos</a> (SoC) sería la siguiente.</p>\n<p>{% highlight javascript %}\nconst getBookExcerpt = book => {\nconst title = <code class=\"language-text\">${book.title.charAt(0).toUpperCase()}${book.title.slice(1)}</code>;\nconst firstName = <code class=\"language-text\">${book.author.name.first.charAt(0).toUpperCase()}${book.author.name.first.slice(1)}</code>;\nconst middleName = book.author.name.middle\n? <code class=\"language-text\">${book.author.name.middle.charAt(0).toUpperCase()}${book.author.name.middle.slice(1)}</code>\n: ”;\nconst lastName = <code class=\"language-text\">${book.author.name.last.charAt(0).toUpperCase()}${book.author.name.last.slice(1)}</code>;\nconst firstChapter = book.chapters[0];\nlet excerpt = firstChapter.slice(0, 1000);</p>\n<p>  return {\ntitle,\nauthor: <code class=\"language-text\">${firstName} ${middleName} ${lastName}</code>,\nexcerpt: firstChapter.length > 1000 ? excerpt.concat(’…‘) : excerpt\n}\n};\n{% endhighlight %}</p>\n<p>Bien, ahora tenemos una función que tan solo devuelve un objeto con el extracto del libro. Todavía no cumple el principio de responsabilidad única al completo y sigue siendo ilegible pero al menos ya podemos decir que es reutilizable. El siguiente paso es crear la función que transforme el objeto en HTML.</p>\n<p>{% highlight javascript %}\nconst toHTML = bookExcerpt => `\\</p>\n  <article>\\\n      <header>\\\n        <h2>${bookExcerpt.title}<h2/>\\\n        <p>${bookExcerpt.author}</p>\\\n      </header>\\\n      <p>${bookExcerpt.excerpt}</p>\\\n  </article>\n{% endhighlight %}\n<p>A diferencia de {% ihighlight javascript %}getBookExcerpt{% endihighlight %}, {% ihighlight javascript %}toHTML{% endihighlight %} si cumple con el principio de responsabilidad única. Su sola operación es formatear el dato entrante y devolver el resultado. Combinando las dos funciones obtendremos el siguiente código.</p>\n<p>{% highlight javascript %}\ntoHTML(getBookExcerpt(book));\n{% endhighlight %}</p>\n<p>Además de haber reducido los cuerpos de las funciones, la combinación de éstas resulta en una llamada mucho más compresible. De hecho no tendría necesidad de acudir a la implementación de cada para entender exactamente qué está ocurriendo: a partir de un libro se extrae un fragmento y se transforma a HTML. Más claro, agua.</p>\n<p>Otra de las ventajas que resultan de esta práctica es que ahora es más fácil ampliar el alcance del programa. Si surge la necesidad de devolver el fragmento del libro en distintos formatos tan solo habría que crear las funciones correspondiente para cada caso. El único requisito es que acepten el objeto devuelto por {% ihighlight javascript %}getBookExcerpt{% endihighlight %}.</p>\n<p>{% highlight javascript %}\nconst toYAML = bookExcerpt => <code class=\"language-text\">title: ${bookExcerpt.title}\n  author: ${bookExcerpt.author}\n  exceprt: ${bookExcerpt.excerpt}</code></p>\n<p>const toJSON = bookExcerpt => JSON.stringify(bookExcerpt)\n{% endhighlight %}</p>\n<p>La función {% ihighlight javascript %}toJSON{% endihighlight %} se puede abreviarse incluso más eliminando la función que la contiene. Tan solo asignaremos la función stringify que es lo que nos interesa a la variable {% ihighlight javascript %}toJSON{% endihighlight %}.</p>\n<p>{% highlight javascript %}\nconst toJSON = JSON.stringify\n{% endhighlight %}</p>\n<p>De hecho no haría falta crear la variable {% ihighlight javascript %}toJSON{% endihighlight %}, tan solo bastaría utilizar la función {% ihighlight javascript %}JSON.stringify{% endihighlight %} disponible en el ámbito global. Pero por una cuestión de coherencia textual es mejor mantener un nombre similar al resto de funciones de la misma familia.</p>\n<p>Con estos nueva gama de funciones podemos otra contenga una nueva operación: seleccionar que tipo de formato transforma el extracto del libro.</p>\n<p>{% highlight javascript %}\nconst transformBookExcerpt = (book, format) => {\nconst excerpt = getBookExcerpt(book);\nswitch(format) {\ncase ‘json’: return toJSON(bookExcerpt);\ncase ‘yaml’: return toYAML(bookExcerpt);\ncase ‘html’:\ndefault: return toHTML(bookExcerpt);\n}\n};\n{% endhighlight %}</p>\n<p>Por supuesto, esto es solo un ejemplo para ver los beneficios que aporta la utilización de funciones de único propósito. En una situación real las funciones de transformación como {% ihighlight javascript %}toHTML{% endihighlight %} o {% ihighlight javascript %}toYAML{% endihighlight %} serían algo más complejas. Incluso los nombres no serían los apropiados, deberían ser más explicativos. Podrían llamarse algo así como {% ihighlight javascript %}bookExcerptTo + formato{% endihighlight %}. De todas formas insisto en la finalidad meramente ilustrativa del ejemplo.</p>\n<p>Todavía queda pendiente terminar de refactorizar {% ihighlight javascript %}getBookExcerpt{% endihighlight %}. Si observamos tanto el título como el nombre del autor se capitalizan de la misma manera. Claramente esto es otra operación que puede extraerse.</p>\n<p>{% highlight javascript %}\nconst capitalize = (text=”) => <code class=\"language-text\">${text.charAt(0).toUpperCase()}${text.slice(1)}</code>\n{% endhighlight %}</p>\n<p>Una vez extraído {% ihighlight javascript %}getBookExcerpt{% endihighlight %} queda de la siguiente forma.</p>\n<p>{% highlight javascript %}\nconst getBookExcerpt = book => {\nconst title = capitalize(book.title);\nconst firstName = capitalize(book.author.name.first);\nconst middleName = capitalize(book.author.name.middle);\nconst lastName = capitalize(book.author.name.last);\nconst firstChapter = book.chapters[0];\nlet excerpt = firstChapter.slice(0, 1000);</p>\n<p>  return {\ntitle,\nauthor: <code class=\"language-text\">${firstName} ${middleName} ${lastName}</code>,\nexcerpt: firstChapter.length > 1000 ? excerpt.concat(’…‘) : excerpt\n};\n};\n{% endhighlight %}</p>\n<p>Con estos cambios tenemos un fuente mucho más asequible para cualquier neófito.  También hemos creado una serie de funciones reutilizables en cualquier parte del programa. Cabe destacar que a su vez estos bloques son más fácilmente testables al haber reducido el objetivo de la función original a un sola tarea.</p>\n<p>En definitiva, esta particularidad de único propósito permite convertir las funciones en bloques de código reusable y fácil comprensión. Así que cuando abordemos una nueva funcionalidad, no está de más reescribirla hasta conseguir aislar todas aquellas partes que puedan ser reusables.</p>\n<p>También es recomendable si trabajas dentro de un equipo y no tienes un claro conocimiento del proyecto, antes de abordar una nueva funcionalidad es mejor preguntar a otro miembro más veterano si alguna de las acciones que vas a abordar ya estuviera hecha. Recuerda que no hay que repetirse.</p>\n<h2>Fuentes</h2>\n<ul>\n<li><a href=\"https://codeburst.io/understanding-solid-principles-single-responsibility-b7c7ec0bf80\">codeburst.io/understanding-solid-principles-single-responsibility-b7c7ec0bf80</a></li>\n<li><a href=\"https://www.toptal.com/software/single-responsibility-principle\">toptal.com/software/single-responsibility-principle</a></li>\n<li><a href=\"http://www.oodesign.com/single-responsibility-principle.html\">oodesign.com/single-responsibility-principle.html</a></li>\n</ul>","frontmatter":{"title":"Principio de responsabilidad única","date":"March 29, 2018","translations":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/es/2018-03-29-principio-responsabilidad-unica/","language":"es","previous":{"fields":{"slug":"/es/2018-03-20-pure-function/"},"frontmatter":{"title":"Pure Function"}},"next":null}}